# Dataframe Drop and Adding

In [1]:
import pandas as pd
import numpy as np

In [2]:
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti'] 
article = [210, 211, 114, 178] 
  
auth_series = pd.Series(author) 
article_series = pd.Series(article) 
  
frame = { 'Author': auth_series, 'Article': article_series } 
  
result = pd.DataFrame(frame)

In [3]:
result

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [5]:
result.drop(['Author'],axis=1)

   Article
0      210
1      211
2      114
3      178

In [6]:
result

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [7]:
# Adding columns
result['Pages'] = [1,2,3,4]

In [8]:
result

     Author  Article  Pages
0  Jitender      210      1
1   Purnima      211      2
2     Arpit      114      3
3     Jyoti      178      4